[
    {
        "date": "2016",
        "description": "Basking Ridge was home to the Old Oak Tree, a 600-year-old white oak, perhaps the oldest white oak in the world. The tree was located on the historic graveyard of the local Presbyterian church. The tree was 97 feet (30 m) high and had a trunk circumference of 20 feet (6.1 m) and its lower branches were supported. In 2016 the tree showed signs of distress as its upper parts failed to sprout leaves. A big portion of the tree was cut down in 2017 due to decay. The tree has since been cut down as of April 26, 2017."
    },
    {
        "date": "1779",
        "description": "A specially designed experimental hospital was built in 1779 by local resident John \"Rebel Banker\" Morton with the help of Dr. James Tilton in the winter of 1779-80. The hospital was built with three wards, that held patients in its hub and each of the three wards held eight patients. Patient beds were oriented so that their heads were closest to the walls of the buildings. When temperatures fell, a \"fire was built in the midst of the ward, without any chimney, and the smoke circulating about, passed off through an opening about 4 inches wide in the ridge of the roof.\" Tilton described how the design of the building allowed infection to be fought using smoke, \"without giving the least offense to the patient, for it always rose above their heads, before it spread abroad in the ward.\" This hospital, which could accommodate up to 55 patients, provided an uncrowded but fully ventilated space in which those with infectious disease could be kept apart from those who were wounded."
    },
    {
        "date": "1912",
        "description": "The Bernards Township Municipal Hall was once owned by the Astors. The estate was built in 1912 by Samuel Owen of Newark, New Jersey."
    },
    {
        "date": "1809",
        "description": "The Brick Academy was built in 1809 as the Basking Ridge Classical School; its function was to prepare young men for the College of New Jersey (now known as Princeton University). It has also served as a public school, a union hall, a public library, and the municipal hall for Bernards Township. It now serves as a historic museum for Basking Ridge and as the home of The Historical Society of the Somerset Hills."
    },
    {
        "date": "1768",
        "description": "The Van Dorn Mill was built in 1768 as a wooden structure; it was rebuilt in 1843 with foundations extending 20 feet (6.1 m) below ground level, using thousands of stones hauled from the hedgerows of nearby farms."
    },
    {
        "date": "1839",
        "description": "The Basking Ridge Presbyterian Church is a Greek Revival church built in 1839 and expanded in 1869, that is listed on the New Jersey Register of Historic Places and added to the National Register of Historic Places on December 31, 1974."
    },
    {
        "date": "1740",
        "description": "Alward Farm House is a Colonial era farmhouse representing the simple lifestyle of early settlers.  Built c.1740, it is one of the first structures in Bernards Township.  Entered in State and National Registers, 1986."
    },
    {
        "date": "July 21, 1976",
        "description": "Basking Ridge Classical School, added July 21, 1976"
    },
    {
        "date": "December 31, 1974",
        "description": "Presbyterian Church in Basking Ridge, added December 31, 1974"
    },
    {
        "date": "June 22, 1978",
        "description": "Lord Stirling Manor Site, added June 22, 1978"
    },
    {
        "date": "August 8, 1974",
        "description": "Basking Ridge Historic District, added August 8, 1974."
    },
    {
        "date": "1905",
        "description": "Liberty Corner School, was built for a farming community in 1905. It is the oldest school in the district. Part of the original building still remains today. It is located in the Liberty Corner section of Bernards Township."
    },
    {
        "date": "1938",
        "description": "Oak Street School was built in 1938, although it was completed late. It was dedicated on November 21, 1939, and opened on November 23, the day before Thanksgiving. Dr. Horatio Gates Whitnall originally owned the property on which Oak Street School was built. The land was used for farming and his home was what is now the Summit Bank. Over the years, the population rose rapidly. It serves downtown Basking Ridge which is the area around the Presbyterian Church and the Old Oak Tree."
    },
    {
        "date": "1956",
        "description": "Cedar Hill School was built 1956. It is situated on land which was once the property of a succession of wealthy families: Owen, Lee, Bissell, and Astor. It was donated in the Mid 1950s by the Lees. It serves the area around William Annin Middle School and Ridge High School."
    },
    {
        "date": "1999",
        "description": "Mount Prospect was built in 1999. The school was built because a new population rolled in by 2000. Basking Ridge was extended southward and a new subdivision was built: The Hills. Mount Prospect is the newest school in the district and serves the Hills."
    },
    {
        "date": "1912",
        "description": "Basking Ridge: Built in 1912 by the Delaware, Lackawanna and Western Railroad, it serves downtown and north Basking Ridge."
    },
    {
        "date": "1931",
        "description": "Lyons: Built in 1931 by the Delaware, Lackawanna and Western Railroad, it serves the Hills, and south Basking Ridge in addition to Liberty Corner. Lyons gets more passengers than Basking Ridge."
    },
    {
        "date": "1974",
        "description": "J. C. Chandor (born 1974), Academy award-nominated writer/director of the 2011 film Margin Call"
    },
    {
        "date": "1950",
        "description": "Chris Daggett (born 1950), former regional administrator of the United States Environmental Protection Agency and Commissioner of the New Jersey Department of Environmental Protection who ran for Governor of New Jersey in 2009 as an independent"
    },
    {
        "date": "1999",
        "description": "Marc Del Gaizo (born 1999), professional ice hockey defenseman for the Nashville Predators of the National Hockey League"
    },
    {
        "date": "1955",
        "description": "Scott Fischer (1955–1996), climber and guide who was the first American to climb Lhotse, the fourth-highest mountain in the world. He died on May 11, 1996, in an attempt to climb Mount Everest in the 1996 Everest Disaster"
    },
    {
        "date": "1934",
        "description": "Patricia Lee Gauch (born 1934), author of over 30 works of children's literature who was inducted into the New Jersey Literary Hall of Fame in 1993"
    },
    {
        "date": "1974",
        "description": "Jon Gutwillig (born 1974), guitarist of the Disco Biscuits"
    },
    {
        "date": "1988",
        "description": "Tobin Heath (born 1988), 2x World Cup Champion and 2x Olympic gold medalist soccer player with the United States women's national team"
    },
    {
        "date": "1918",
        "description": "Vincent R. Kramer (1918–2001), United States Marine Corps colonel who was a guerrilla warfare expert and was awarded the Navy Cross during the Korean War"
    },
    {
        "date": "1955",
        "description": "Peter Kuhn (1955–2009), race car driver who won both the USAC and SCCA Formula Super Vee championships in 1980"
    },
    {
        "date": "1786",
        "description": "Philip Lindsley (1786–1855), Presbyterian minister, educator and classicist who served as the acting president of the College of New Jersey (now Princeton University) from 1822 to 1824"
    },
    {
        "date": "1963",
        "description": "Page McConnell (born 1963), keyboardist best known for his work with Phish"
    },
    {
        "date": "1932",
        "description": "Robert Mulcahy (1932–2022), former athletic director at Rutgers University"
    },
    {
        "date": "1984",
        "description": "Akshay Nanavati (born 1984), United States Marine Corps veteran, speaker, entrepreneur, ultra runner and author of Fearvana"
    },
    {
        "date": "1825",
        "description": "Edmund Perry (1825–1878), politician and newspaper publisher, who served as President of the New Jersey Senate from 1861 to 1862"
    },
    {
        "date": "1967",
        "description": "Jasbir Puar (born 1967), queer theorist, Professor of Women and Gender Studies at Rutgers University and author of The Right to Maim"
    },
    {
        "date": "1917",
        "description": "Perry Scott (1917–1988), American football player and coach, who played in the NFL for the Detroit Lions"
    },
    {
        "date": "1999",
        "description": "Helen J. Shen (born 1999/2000), actress and singer, known for her roles on and off-Broadway"
    },
    {
        "date": "1787",
        "description": "Samuel Lewis Southard (1787–1842), served as U.S. Senator, Secretary of the Navy and as the 10th Governor of New Jersey"
    },
    {
        "date": "1949",
        "description": "Meryl Streep (born 1949), multiple Oscar-winning actress"
    },
    {
        "date": "1979",
        "description": "LaDainian Tomlinson (born 1979), former NFL running back who played for the San Diego Chargers"
    },
    {
        "date": "February 13, 2023",
        "description": "^ \"ArcGIS REST Services Directory\". United States Census Bureau. Archived from the original on February 13, 2023. Retrieved October 11, 2022."
    },
    {
        "date": "July 3, 2012",
        "description": "^ U.S. Geological Survey Geographic Names Information System: Basking Ridge, Geographic Names Information System. Accessed July 3, 2012."
    },
    {
        "date": "October 2, 2023",
        "description": "^ a b QuickFacts Basking Ridge CDP, New Jersey Archived October 2, 2023, at the Wayback Machine, United States Census Bureau. Accessed June 17, 2023."
    },
    {
        "date": "August 2, 2017",
        "description": "^ Look Up a ZIP Code for Basking Ridge, NJ Archived August 2, 2017, at the Wayback Machine, United States Postal Service. Accessed July 3, 2012."
    },
    {
        "date": "June 17, 2019",
        "description": "^ Zip Codes Archived June 17, 2019, at the Wayback Machine, State of New Jersey. Accessed August 27, 2013."
    },
    {
        "date": "November 19, 2018",
        "description": "^ Geographic Codes Lookup for New Jersey Archived November 19, 2018, at the Wayback Machine, Missouri Census Data Center. Accessed June 9, 2023."
    },
    {
        "date": "January 1, 2020",
        "description": "^ State of New Jersey Census Designated Places - BVP20 - Data as of January 1, 2020 Archived April 23, 2021, at the Wayback Machine, United States Census Bureau. Accessed January 1, 2023."
    },
    {
        "date": "2016",
        "description": "^ Locality Search Archived 2016-07-09 at the Wayback Machine, State of New Jersey. Accessed June 9, 2016."
    },
    {
        "date": "July 24, 2023",
        "description": "^ Capuzzo, Jill P., \"Living in Basking Ridge, N.J.: A Polished Past and Polite People\" Archived July 24, 2023, at the Wayback Machine, New York Times, Published April 2, 2013. Accessed July 24, 2023."
    },
    {
        "date": "May 20, 2023",
        "description": "^ \"Basking Ridge CDP, New Jersey\". United States Census Bureau. Archived from the original on May 20, 2023. Retrieved May 20, 2023."
    },
    {
        "date": "August 10, 2017",
        "description": "^ Cheslow, Jerry. \"If You're Thinking of Living In: Basking Ridge, N.J.;A Rich Hamlet That Gobbled Up a Town\" Archived August 10, 2017, at the Wayback Machine, The New York Times, November 19, 1995. Accessed October 11, 2015. \"The recorded history of Basking Ridge goes back to 1717, when John Harrison, an agent of King James III, bought most of what is now Bernards Township from Chief Nowenok of the Leni Lenape Indians for the equivalent of $50. According to Mrs. Kennedy, the first settlers were English and Scottish Presbyterians escaping religious persecution.\""
    },
    {
        "date": "1776",
        "description": "^ Staff. \"December 13 - This Day in History; 1776 -General Charles Lee leaves his troops for Widow White's tavern\" Archived September 5, 2015, at the Wayback Machine, History (U.S. TV channel). Accessed October 11, 2015. \"On this day in 1776, American General Charles Lee leaves his army, riding in search of female sociability at Widow White's Tavern in Basking Ridge, New Jersey....  Lee rode to Widow White's tavern with a minimal guard and it was there that Banastre Tarleton and the 16th Queen's Light Dragoons captured him on the morning of December 15.\""
    },
    {
        "date": "July 18, 2023",
        "description": "^ \"Ridge Defeats Borough Act\" Archived July 18, 2023, at the Wayback Machine, Bernardsville News, June 9, 1921. Accessed July 18, 2023, via Newspapers.com. \"Basking Ridge by defeating the borough proposition today by a majority of 127 votes, chose to remain in the Township with Bernardsville and Liberty Corner. There were 161 ballots cast against the borough and 34 in favor.\""
    },
    {
        "date": "July 6, 2022",
        "description": "^ \"Decennial Census of Population and Housing by Decade\". United States Census Bureau. Archived from the original on July 6, 2022."
    },
    {
        "date": "1950",
        "description": "^ a b \"1950 Census of Population - Number of Inhabitants - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on March 23, 2025."
    },
    {
        "date": "1960",
        "description": "^ a b \"1960 Census of Population - Number of Inhabitants - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on March 22, 2025."
    },
    {
        "date": "1970",
        "description": "^ \"1970 Census of Population - Charecteristics of the Population - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on April 13, 2025."
    },
    {
        "date": "1980",
        "description": "^ \"1980 Census of Population - Volume 1 - Characteristics of the Population - Number of Inhabitants - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on February 8, 2025."
    },
    {
        "date": "1990",
        "description": "^ \"1990 Census of Population - Population and Housing Unit Counts - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on March 23, 2025."
    },
    {
        "date": "2000",
        "description": "^ \"2000 Census of Population and Housing - Population and Housing Unit Counts - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on March 26, 2025."
    },
    {
        "date": "2010",
        "description": "^ \"2010 Census of Population - Population and Housing Unit Counts - New Jersey\" (PDF). United States Census Bureau. Archived from the original (PDF) on November 11, 2025."
    },
    {
        "date": "2020",
        "description": "^ \"2020 Geography Changes\". United States Census Bureau."
    },
    {
        "date": "2020",
        "description": "^ a b \"P2 Hispanic or Latino, and Not Hispanic or Latino by Race – 2020: DEC Redistricting Data (PL 94-171) Hispanic or Latino, and Not Hispanic or Latino by Race – Basking Ridge CDP, New Jersey\". United States Census Bureau. Archived from the original on May 20, 2023. Retrieved May 20, 2023."
    },
    {
        "date": "2010",
        "description": "^ DP-1 - Profile of General Population and Housing Characteristics: 2010 from 2010 Demographic Profile Data for ZCTA5 07920 Archived 2020-02-12 at archive.today, United States Census Bureau. Accessed August 27, 2013."
    },
    {
        "date": "December 27, 1996",
        "description": "^ U.S. Census website Archived December 27, 1996, at the Wayback Machine , United States Census Bureau. Accessed September 4, 2014."
    },
    {
        "date": "2000",
        "description": "^ a b c d DP-1 - Profile of General Demographic Characteristics: 2000 from Census 2000 Summary File 1 (SF 1) 100-Percent Data for ZCTA5 07920 Archived 2020-02-12 at archive.today, United States Census Bureau. Accessed August 27, 2013."
    },
    {
        "date": "2010",
        "description": "^ a b \"2010 Census Briefs: Age and Sex Composition\" (PDF). Archived (PDF) from the original on January 16, 2021. Retrieved December 7, 2017."
    },
    {
        "date": "May 28, 2014",
        "description": "^ \"Household Income for States\" (PDF). Archived from the original (PDF) on May 28, 2014. Retrieved December 7, 2017."
    },
    {
        "date": "July 1, 2016",
        "description": "^ a b Hickey, Magee. \"Basking Ridge rallies behind 600-year-old white oak tree\" Archived July 1, 2016, at the Wayback Machine, WPIX, June 29, 2016. Accessed July 2, 2016."
    },
    {
        "date": "2016",
        "description": "^ A Walking Tour of Historic Basking Ridge Village Archived 2016-08-19 at the Wayback Machine, The Historic Society of the Somerset Hills. Accessed July 2, 2016. \"Over the tombstones broods the ancient White Oak (Quercus alba), more than 600 years old. It stands tall at 97', with a spread of 156' and a circumference of 18'.\""
    },
    {
        "date": "October 20, 2016",
        "description": "^ Barron, James. \"A 600-Year-Old Oak Tree Finally Succumbs\" Archived October 20, 2016, at the Wayback Machine, The New York Times, October 16, 2016. Accessed February 22, 2017. \"Basking Ridge, N.J. — The locals say that George Washington and the Marquis de Lafayette — the Frenchman who bankrolled the American patriots with cold, hard cash — picnicked in the shade it provided. Rank-and-file soldiers are said to have rested under it, gathering strength before going on to beat the redcoats. It is a huge oak tree, now estimated to be 600 years old.\""
    },
    {
        "date": "October 2, 2023",
        "description": "^ \"Basking Ridge in Revolutionary Days\" Archived October 2, 2023, at the Wayback Machine, Somerset County Historical Quarterly, Volume 2, p. 245. Accessed March 22, 2020."
    },
    {
        "date": "October 2, 2023",
        "description": "^ Risch, Erna. Supplying Washington's Army Archived October 2, 2023, at the Wayback Machine, p. 375. United States Army Center of Military History, 1981. Accessed March 22, 2020."
    },
    {
        "date": "September 27, 2025",
        "description": "^ The Brick Academy, The Historical Society of the Somerset Hills. Accessed September 27, 2025. \"Known also as the original Basking Ridge Classical School, the 1809 Federal-style Brick Academy located in the center of the Basking Ridge section of Bernards Township has been a boys’ private preparatory school, a public school, a meeting hall for several fraternal and benevolent organizations, and the Bernards Township municipal building.... It currently serves as the headquarters of The Historical Society of the Somerset Hills, as well as a schoolhouse and museum to local history.\""
    },
    {
        "date": "October 2, 2023",
        "description": "^ Siegel, Alan A. Somerset County in Vintage Postcards Archived October 2, 2023, at the Wayback Machine, p. 14. Arcadia Publishing, 1999. ISBN 9780738500782. Accessed November 20, 2017. \"Van Dorn's Mill, Basking Ridge, N, J. VAN DORN'S MILL, C. 1910. One of New Jersey's finest stone buildings, with foundations that extend 20 feet below ground and basement walls 4 feet thick, the mill was completed in 1843. Thousands of stone loads were hauled from farm hedgerows on Hardscrabble Road.\""
    },
    {
        "date": "December 1, 2017",
        "description": "^ History Archived December 1, 2017, at the Wayback Machine, Basking Ridge Presbyterian Church. Accessed November 30, 2017. \"When this became too crowded, the building was sold and removed, and in 1839 a new church in classic Greek revival architecture, was constructed of brick. This structure was enlarged in 1869 and altered in 1908.... The sanctuary, church yard and oak tree are listed in the National Register of Historic Places.\""
    },
    {
        "date": "June 1, 2023",
        "description": "^ \"The Devil's Tree\" Archived June 1, 2023, at the Wayback Machine, Weird NJ. Accessed April 28, 2017."
    },
    {
        "date": "May 16, 2013",
        "description": "^ New Jersey and National Registers of Historic Places - Somerset County Archived May 16, 2013, at the Wayback Machine, New Jersey Department of Environmental Protection Historic Preservation Office, updated November 20, 2017. Accessed November 30, 2017."
    },
    {
        "date": "November 20, 2017",
        "description": "^ Bernards Township Bikeway and Pedestrian Map, Bernards Township. Accessed November 20, 2017."
    },
    {
        "date": "2011",
        "description": "^ Ridge High School Archived 2011-07-07 at the Wayback Machine, Bernards Township School District. Accessed March 27, 2011."
    },
    {
        "date": "2011",
        "description": "^ William Annin Middle School History Archived 2011-10-03 at the Wayback Machine, Bernards Township School District. Accessed March 27, 2011"
    },
    {
        "date": "October 21, 2012",
        "description": "^ Cooperative Seismographic Network Archived October 21, 2012, at the Wayback Machine, Lamont–Doherty Earth Observatory. Accessed October 17, 2012."
    },
    {
        "date": "October 17, 2012",
        "description": "^ Hayes, Edward. \"School in Bernards tracks earthquakes\", Courier News, January 21, 201. Accessed October 17, 2012. \"There are several colleges and universities that maintain seismology equipment for studying, tracking and monitoring earthquakes. And along with them is William Annin Middle School, which maintains its own seismograph for Lamont–Doherty Earth Observatory at Columbia University in New York.\""
    },
    {
        "date": "2012",
        "description": "^ Liberty Corner Elementary School History Archived 2012-12-09 at the Wayback Machine, Bernards Township School District. Accessed September 25, 2012."
    },
    {
        "date": "2013",
        "description": "^ Oak Street Elementary School Archived 2013-03-25 at the Wayback Machine, Bernards Township School District. Accessed September 25, 2012."
    },
    {
        "date": "2012",
        "description": "^ Cedar Hill Elementary School History Archived 2012-10-31 at the Wayback Machine, Bernards Township School District. Accessed September 25, 2012."
    },
    {
        "date": "2012",
        "description": "^ Mount Prospect Elementary School Archived 2012-11-01 at the Wayback Machine, Bernards Township School District. Accessed September 25, 2012."
    },
    {
        "date": "2015",
        "description": "^ History of the Library (Page 5) Archived 2015-01-28 at the Wayback Machine, Bernards Township Library. Accessed January 24, 2015."
    },
    {
        "date": "September 24, 2024",
        "description": "^ About Us, Saint James School. Accessed September 24, 2024."
    },
    {
        "date": "September 24, 2024",
        "description": "^ School Finder, Roman Catholic Diocese of Metuchen. Accessed September 24, 2024."
    },
    {
        "date": "September 24, 2024",
        "description": "^ Current Awardees, United States Department of Education. Accessed September 24, 2024."
    },
    {
        "date": "September 23, 2024",
        "description": "^ Kelley, Tina. \"11 new National Blue Ribbon Schools named in N.J.\", NJ Advance Media for NJ.com, September 23, 2024. Accessed September 24, 2024. \"Eleven public and private schools have been chosen as New Jersey’s newest National Blue Ribbon Schools, the U.S. Department of Education announced Monday.\""
    },
    {
        "date": "April 17, 2016",
        "description": "^ Gladstone Branch Archived April 17, 2016, at the Wayback Machine, NJ Transit. Accessed November 30, 2017."
    },
    {
        "date": "December 1, 2017",
        "description": "^ Basking Ridge Archived December 1, 2017, at the Wayback Machine, NJ Transit. Accessed November 30, 2017."
    },
    {
        "date": "December 1, 2017",
        "description": "^ Lyons Archived December 1, 2017, at the Wayback Machine, NJ Transit. Accessed November 30, 2017."
    },
    {
        "date": "May 26, 2018",
        "description": "^ Route 78 - Eastbound to New York Archived May 26, 2018, at the Wayback Machine, Lakeland Bus Lines. Accessed November 20, 2017."
    },
    {
        "date": "May 21, 2020",
        "description": "^ Elstein, Aaron. \"Capturing Wall Street on the silver screen; One reason Margin Call expertly captures how investment bankers and traders look, sound and see the world is that its writer and director, J.C. Chandor, is a son of Wall Street. He was also inspired by other movies about business.\" Archived May 21, 2020, at the Wayback Machine, Crain's New York Business, November 6, 2011. Accessed June 19, 2013. \"As a youth growing up in Basking Ridge, N.J., Mr. Chandor hung out on the Merrill Lynch's trading floor in lower Manhattan while his father, an investment banker, worked the phones making deals.\""
    },
    {
        "date": "October 16, 2012",
        "description": "^ Nutt, Amy Ellis. \"Chris Daggett, ever the policy wonk, concentrates on the details\" Archived October 16, 2012, at the Wayback Machine, The Star-Ledger, October 11, 2009. Accessed May 15, 2011. \"As an independent, Daggett straddles more than just political parties. He's a child of the free-thinking, authority-mocking 1960s — and a buttoned-down, plow-ahead grinder. The life-long Basking Ridge resident graduated from the University of North Carolina at Chapel Hill, where he says his college thesis was 'something out of the '60s, like the study of personhood.'\""
    },
    {
        "date": "November 16, 2023",
        "description": "^ Marc Del Gaizo, UMass Minutemen ice hockey. Accessed November 16, 2023. \"Born Marc Douglas Del Gaizo on October 11, 1999 in Basking Ridge, New Jersey.\""
    },
    {
        "date": "April 26, 2003",
        "description": "^ Powers, Phil. \"Scott Style: Adventure Student Makes Good\" Archived April 26, 2003, at the Wayback Machine, The Leader of the National Outdoor Leadership School, Winter 1992. Accessed May 15, 2011. \"Fischer's mountaineering background began at the young age of 14 when he took a NOLS Adventure Course. His father was an outdoor enthusiast who called Scott in to watch a television program one night at their home in Basking Ridge, New Jersey.\""
    },
    {
        "date": "May 17, 2008",
        "description": "^ Horner, Shirley. \"About Books\" Archived May 17, 2008, at the Wayback Machine, The New York Times, October 3, 1993. Accessed December 19, 2007. \"The other inductees are Patricia Lee Gauch of Basking Ridge, who has written more than 30 children's books\""
    },
    {
        "date": "2016",
        "description": "^ Grace, Jeff. \"Tribeca Film Festival 2016 Diary: Director Jeff Grace of Folk Hero & Funny Guy\" Archived June 10, 2016, at the Wayback Machine, MovieMaker, April 22, 2016. Accessed May 19, 2016. \"I grew up outside the city in Basking Ridge, New Jersey, so NYC was the stomping grounds of my teen years.\""
    },
    {
        "date": "December 31, 2009",
        "description": "^ Spelling, Ian. \"The Disco Biscuits will play the Nokia Theatre in Manhattan\" Archived December 31, 2009, at the Wayback Machine, The Record, December 23, 2009. Accessed December 4, 2011. \"Gutwillig – who grew up in Morristown/Basking Ridge — and the boys are actually several bands.\""
    },
    {
        "date": "January 18, 2010",
        "description": "^ Giase, Frank. \"Basking Ridge native Tobin Heath selected No. 1 overall in WPS Draft\" Archived January 18, 2010, at the Wayback Machine, The Star-Ledger, January 15, 2010. Accessed December 4, 2011. \"Basking Ridge native Tobin Heath was selected with the first pick in the Women's Professional Soccer Draft today at the Philadelphia Convention Center.\""
    },
    {
        "date": "July 1, 2020",
        "description": "^ \"Col. Vincent Kramer, decorated Marine veteran\" Archived July 1, 2020, at the Wayback Machine, New Jersey Hills, October 11, 2001. Accessed June 29, 2020. \"Vincent R. Kramer, 83, of the Basking Ridge section of Bernards Township, died on Monday, Sept. 17, 2001, at Morris Hills Multicare Center in Morristown.\""
    },
    {
        "date": "September 22, 2018",
        "description": "^ Staff. \"Peter H. Kuhn, accomplished race car driver\" Archived September 22, 2018, at the Wayback Machine, Hunterdon County Democrat, June 29, 2009. Accessed August 15, 2016. \"Born in Summit, April 14, 1955, he was a son of Jean Henry and Elizabeth 'Lib' Dowd Kuhn. Mr. Kuhn had resided in Franklin Township since 1995, having formerly lived in Basking Ridge and Chatham Township.\""
    },
    {
        "date": "September 28, 2015",
        "description": "^ Harwell, Sara. Philip Lindsley\" Archived September 28, 2015, at the Wayback Machine, Tennessee Encyclopedia of History and Culture. Accessed October 11, 2015. \"Philip Lindsley, an educator, Presbyterian minister, and classical scholar, was born in Basking Ridge, New Jersey.\""
    },
    {
        "date": "2008",
        "description": "^ Page McConnell Archived 2008-11-25 at the Wayback Machine, Legacy Recordings. Accessed November 11, 2008."
    },
    {
        "date": "June 20, 2018",
        "description": "^ Caldwell, Dave. \"In Person; Renaissance Man\" Archived June 20, 2018, at the Wayback Machine, The New York Times, December 4, 2005. Accessed January 24, 2008. \"The taciturn Mulcahy, who graduated from Millburn High School and lives in Basking Ridge, did much of the groundwork that let Schiano, after a few tough seasons, become a success in his home state -- their home state.\""
    },
    {
        "date": "September 14, 2018",
        "description": "^ Cerasaro, Ashley J. \"Ice Road Trekker For this Basking Ridge resident, a 342-mile trek on skis across Greenland's enormous ice cap is just a walk in the park.\" Archived September 14, 2018, at the Wayback Machine, New Jersey Monthly, January 16, 2012. Accessed September 13, 2018. \"'I want to experience a bit of everything because each experience presents its own challenges and forces you to face different fears,' says Nanavati, a native of India who moved to Basking Ridge with his wife, Shruthi, just over a year ago to be near her family.\""
    },
    {
        "date": "February 6, 2023",
        "description": "^ History of Hunterdon and Somerset Counties, New Jersey: With Illustrations and Biographical Sketches of Its Prominent Men and Pioneers Archived February 6, 2023, at the Wayback Machine, p. 212. Everts & Peck, 1881. Accessed February 6, 2023. \"Edmund Perry was born at Basking Ridge, Somerset Co., Oct 4., 1825.\""
    },
    {
        "date": "April 21, 2021",
        "description": "^ \"Urban Skills Project Helps Ease Trauma Of The Past\" Archived April 21, 2021, at the Wayback Machine, Bernardsville News, August 29, 1985. Accessed April 21, 2021, via Newspapers.com."
    },
    {
        "date": "June 5, 2023",
        "description": "^ \"Lt. L. P. Scott is Honored Again; Basking Ridge Young Man Receives Third Oak Leaf Cluster To His Air Medal.\" Archived June 5, 2023, at the Wayback Machine, Bernardsville News, August 31, 1944. Accessed June 5, 2023, via Newspapers.com. \"First Lt. Perry Scott, son of Leonard P. Scott, Basking Ridge, pilot of a B-24 Liberator, has been awarded a third Oak Leaf Cluster to the Air Medal.... He is a graduate of Bernards High School, Bernardsville, and of Muhlenherg College, Allentown, Pa.\""
    },
    {
        "date": "November 11, 2024",
        "description": "^ \"Hometown Hero Helen J Shen of Basking Ridge leading Broadway Debut of Maybe Happy Ending\", New York City, NY Patch, November 11, 2024. Accessed March 16, 2025. \"Helen J Shen, a native of New Jersey, 2018 Ridge High School graduate, will lead the show opposite the Emmy and Golden Globe winner Darren Chriss.... Born and raised in Basking Ridge, Helen developed strong interest in music, art and theatric performance early on.\""
    },
    {
        "date": "November 11, 2011",
        "description": "^ Samuel Lewis Southard Archived November 11, 2011, at the Wayback Machine, Biographical Directory of the United States Congress. Accessed July 29, 2007."
    },
    {
        "date": "December 6, 2018",
        "description": "^ Kuperinsky, Amy (December 6, 2018). \"Meryl Streep, at home in N.J., says she empathizes with Trump (who called her overrated)\". NJ.com. Archived from the original on July 22, 2019. Retrieved July 22, 2019."
    },
    {
        "date": "August 31, 2016",
        "description": "^ Bishop, Greg. \"Tomlinson Relishes New Home, and New Opportunity\" Archived August 31, 2016, at the Wayback Machine, The New York Times, June 8, 2010. Accessed January 24, 2015."
    },
    {
        "date": "January 28, 2015",
        "description": "^ Mehta, Manish. \"New York Jets running back LaDainian Tomlinson reborn with birth of son Daylen Oliver\" Archived January 28, 2015, at the Wayback Machine, New York Daily News, August 8, 2010. Accessed January 24, 2015."
    },
    {
        "date": "January 1, 2020",
        "description": "^ Rockland, Kate. \"The Band They All Ache To Become\" Archived January 1, 2020, at the Wayback Machine, The New York Times, December 5, 2004. Accessed January 24, 2015. \"The Bouncing Souls are true sons of New Jersey and have the tattoos to prove it.... And on a dark, foggy November night straight out of a Goth girl's dream, the boys, who grew up in Basking Ridge, were back home.\""
    }
]